// Функция должна проверить, что строка состоит исключительно из заглавных английских букв.
// Если все символы являются заглавными буквами, возвращаем 1.
// Если встретился любой другой символ, возвращаем 0.
// Пустая строка должна возвращать 1.


#include <stdio.h>

int ft_str_is_uppercase(char *str)
{
    // Реализовать функцию
    int i;

    i = 0;
    while(str[i] != '\0')
    {
    	if (str[i] >= 'A' && str[i] <= 'Z')
    	{
		i++;
    	}
	else
	{
		return (0);
	}
    }
    return (1);
}

