// Функция должна проверить, состоит ли переданная строка исключительно из английских букв. 
// Если все символы являются буквами, возвращаем 1.
// Если встретился хотя бы один символ, который не является буквой, возвращаем 0.
// Если строка пустая, возвращаем 1.
//
// Ожидаемая логика
// 1. Берём первый символ строки.
// 2. Проверяем, является ли он английской буквой.
// 3. Если да, переходим к следующему символу.
// 4. Если нет, возвращаем 0.
// 5. Если проверили всю строку и ошибок нет, возвращаем 1.

#include <stdio.h>

int ft_str_is_alpha(char *str)
{
    // Реализовать функцию
    int i;

    i = 0;
    while(str[i] != '\0')
    {
    	if ((str[i] <= 'Z' && str[i] >= 'A') || (str[i] >= 'a' && str[i] <= 'z'))
	{
		i++;	
	}
	else
	{
		return (0);	
	}	
    }

    return (1);
}

int main(void)
{
    char str1[] = "Alexey"; // 1
    char str2[] = "Alex123"; // 0
    char str3[] = "Hello World"; // 0
    char str4[] = ""; // 1   32 Z 90 z 122 A 65 a 97

    printf("Alexey: %d\n", ft_str_is_alpha(str1));
    printf("Alex123: %d\n", ft_str_is_alpha(str2));
    printf("Hello World: %d\n", ft_str_is_alpha(str3));
    printf("Empty: %d\n", ft_str_is_alpha(str4));

    return (0);
}
